from random import shuffle
alf = """0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ!"'№;%:?*()_+-="""
alf_list = list(alf)
shifr = list(alf)
shuffle(shifr)
print(shifr)
shifr = ['и', 'Н', 'С', 'о', 'р', 't', 'z', 'h', 'е', ';', 'з', 'А', 'п', 'ц', 'v', 's', 'p', '№', 'F', 'ы', 'J', 'ю', 'ш', 'Х', 'l', 'ъ', 'Л', 'Ю', 'Ь', 'й', 'i', '?', 'O', 'a', '0', '"', '_', 'в', '-', 'ж', 'н', '4', 'Ъ', 'Ж', 'Д', 'A', 'И', 'W', 'д', 'g', '+', 'Ш', 'Ф', 'P', 'R', 'Z', ':', 'b', 'w', 'c', 'Ч', 'S', '%', 'n', 'ё', '5', 'м', 'К', 'B', 'L', 'О', 'Б', '6', '!', 'f', 'I', 'N', 'Г', 'H', 'Р', ' ', 'y', 'U', 'D', 'ь', '9', 'r', 'e', 'г', '1', 'т', 'Я', '7', 'В', 'X', 'б', 'Ц', 'o', "'", 'Т', '3', 'j', 'щ', '2', 'K', 'q', 'Э', 'd', 'Q', 'а', 'x', 'G', 'T', 'Ы', '8', '(', 'к', 'Й', 'л', 'k', 'Е', 'E', 'Щ', 'х', 'Y', 'с', 'ф', 'П', 'У', '=', 'ч', 'u', 'я', 'М', 'у', 'M', 'C', 'V', 'Ё', 'm', ')', '*', 'э', 'З']
alf_dict = dict(zip(alf_list, shifr))
alf_dict_back = dict(zip(shifr, alf_list))
print(alf_dict_back)